backend/app/controllers/generator_controller.rb

    def generate_encounter
      encounter = Encounter.order("RANDOM()").first
---
SELECT "encounters".* FROM "encounters" ORDER BY RANDOM() LIMIT 1

    def generate_npc
      npc = Npc.order("RANDOM()").first
---
SELECT "npcs".* FROM "npcs" ORDER BY RANDOM() LIMIT 1

    def generate_treasure
      treasure = Treasure.order("RANDOM()").first
---
SELECT "treasures".* FROM "treasures" ORDER BY RANDOM() LIMIT 1